[Timeout] Equality mutation
repos/StrykerDemo/Library/Person.cs:11:16
 
     public bool IsAllowedToBuyAlcohol()
     {
-        return Age >= 18;
+        return Age < 18;
     }
 

[Timeout] Equality mutation
repos/StrykerDemo/Library/Person.cs:11:16
 
     public bool IsAllowedToBuyAlcohol()
     {
-        return Age >= 18;
+        return Age > 18;
     }
 

[Timeout] Equality mutation
repos/StrykerDemo/Library/Person.cs:16:13
 
     public bool IsValidName()
     {
-        if (Name.Length > 10)
+        if (Name.Length >= 10)
         {
             return false;

[Timeout] Equality mutation
repos/StrykerDemo/Library/Person.cs:16:13
 
     public bool IsValidName()
     {
-        if (Name.Length > 10)
+        if (Name.Length < 10)
         {
             return false;

[Survived] Equality mutation
repos/StrykerDemo/Library/Person.cs:21:13
             return false;
         }
 
-        if (char.ToLowerInvariant(Name[0]) == 'b')
+        if (char.ToLowerInvariant(Name[0]) != 'b')
         {
             return false;
